      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  NUM PIC Z(10).

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "INGRESE NUMERO ".
           ACCEPT NUM.

           DISPLAY NUM.



       END PROGRAM YOUR-PROGRAM-NAME.
